notes/sept18/sept18.org
#+html_head: <link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
#+html_head: <script src="../../jquery.min.js"></script>
#+html_head: <script src="../../bootstrap.min.js"></script>
#+html_head: <script type="text/javascript" src="../../readtheorg.js"></script>

#+Author: Julian Grove
#+Title: Untyped λ-calculus via de Bruijn indices

* Review
  We've begun to encode untyped λ-terms using de Bruijn indices, meaning that
  rather than writing, e.g., the identity function as
  $$λx.x$$
  we write it instead as
  $$λ0$$
  Here, the variable $0$ is bound by the /first/ $λ$ prefixed to a λ-term in which
  it occurs; i.e., $0$ itself. Likewise, if we want to encode the function that
  takes two arguments and just gives back the first one, we would normally write
  it as
  $$λx, y.x$$
  but using de Bruijn indices, we'd write it instead as
  $$λλ1$$
  Here, the $1$ is bound by the /second/ $λ$ prefixed to a λ-term in which it
  occurs; i.e.; the $λ$ prefixed to $λ1$.

** Syntax
   Technically, we can specify the set of λ-terms in terms of de Bruijn notation
   as
   $$\def\Coloneqq{::=}\def\divd{\ |\ } M, N \Coloneqq n \divd (M N) \divd
   (λM)$$
   where $n ∈ \{0, 1, 2, ...\}$.

   In Haskell, we can give this encoding of λ-terms in terms of an algebraic
   data type. First, we should define a type for natural numbers:
   #+begin_src haskell
     data Nat = Zero | Succ Nat
   #+end_src
   λ-terms may then be encoded in a way that matches the definition given above:
   #+begin_src haskell
     data Lambda = Var Nat | App Lambda Lambda | Lam Lambda
   #+end_src

