notes/sept18/sept18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-19 Tue 21:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Untyped λ-calculus via de Bruijn indices</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Untyped λ-calculus via de Bruijn indices</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc0f45c2">1. Review</a>
<ul>
<li><a href="#org24943c4">1.1. Syntax</a></li>
<li><a href="#org558f6fc">1.2. Substitution</a></li>
<li><a href="#org17cfe03">1.3. β-reduction</a></li>
</ul>
</li>
<li><a href="#org31054fe">2. Exercises: pretty printing</a>
<ul>
<li><a href="#orgb37bdb9">2.1. Part 1</a></li>
<li><a href="#org51abd26">2.2. Part 2</a></li>
<li><a href="#orgacb4245">2.3. Part 3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc0f45c2" class="outline-2">
<h2 id="orgc0f45c2"><span class="section-number-2">1.</span> Review</h2>
<div class="outline-text-2" id="text-1">
<p>
We've begun to encode untyped λ-terms using de Bruijn indices, meaning that
rather than writing, e.g., the identity function as
\[λx.x\]
we write it instead as
\[λ0\]
Here, the variable \(0\) is bound by the <i>first</i> \(λ\) prefixed to a λ-term in which
it occurs; i.e., \(0\) itself. Likewise, if we want to encode the function that
takes two arguments and just gives back the first one, we would normally write
it as
\[λx, y.x\]
but using de Bruijn indices, we'd write it instead as
\[λλ1\]
Here, the \(1\) is bound by the <i>second</i> \(λ\) prefixed to a λ-term in which it
occurs; i.e.; the \(λ\) prefixed to \(λ1\).
</p>
</div>

<div id="outline-container-org24943c4" class="outline-3">
<h3 id="org24943c4"><span class="section-number-3">1.1.</span> Syntax</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Technically, we can specify the set of λ-terms in terms of de Bruijn notation
as
\[\def\Coloneqq{::=}\def\divd{\ |\ } M, N \Coloneqq n \divd (M N) \divd
   (λM)\]
where \(n ∈ \{0, 1, 2, ...\}\).
</p>

<p>
In Haskell, we can give this encoding of λ-terms in terms of an algebraic
data type. First, we should define a type for natural numbers:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Zero</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Succ</span> <span style="color: #d3869b;">Nat</span>
</pre>
</div>
<p>
λ-terms may then be encoded in a way that matches the definition given above:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">App</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Lam</span> <span style="color: #d3869b;">Lambda</span>
</pre>
</div>
</div>
</div>
