notes/sept18/sept18.org
** Substitution
   Now that we are using de Bruijn indices, substitution becomes a bit tricky.
   But we can tame it by dividing the task up into parts that are manageable to
   do on their own.

   First, let's define a very general function for doing arbitrary substitutions
   of variables by λ-terms. This function should have the following type:
   #+begin_src haskell
     subst :: (Nat -> Lambda) -> Lambda -> Lambda
   #+end_src
   It takes a function of type ~Nat -> Lambda~ determining how the relevant
   substitution (whatever that is) should be performed, and it provides a
   general protocol for managing this substitution for different kinds of
   λ-terms. For example, on variables, ~subst~ just /performs the substution/:
   #+begin_src haskell
     subst f (Var i) = f i
   #+end_src
   On applications, it does the substitution to both the function and the
   argument:
   #+begin_src haskell
     subst f (App t u) = App (subst f t) (subst f u)
   #+end_src
   Finally, on abstractions, something special has to be done. Because we don't
   want to mess around with variables which are /bound/ by the abstraction, we
   need to instead do substitution using another function ~g~ just like the
   function ~f~, but which is different in two ways. The first way it is different
   is that it maps ~Zero~ onto ~Var Zero~, ensuring that it remains bound by the
   enclosing ~Lam~. The second way it is different is that it maps any ~Succ i~ onto
   ~f i~, since the ~Succ~ was only there in order to ``look past'' the enclosing
   ~Lam~ - it should really just be an ~i~ for the purpose of performing the
   substitution - and it then /renames/ the result of performing the substitution
   ~f i~ by incrementing all free variables inside ~f i~ with a ~Succ~, using a
   function ~rename~. This last part helps to avoid the problem of variable
   capture, i.e., by making sure any free ~j~ inside ~f i~ still looks like a ~j~
   outside of the enclosing ~Lam~, which mean that it has to be a ~Succ j~ inside
   the enclosing ~Lam~. 
   #+begin_src haskell
     subst f (Lam t) = Lam (subst g t)
       where g :: Nat -> Lambda
	     g Zero = Var Zero
	     g (Succ i) = rename Succ (f i)
   #+end_src
   How exactly does ~rename~ work? It should take some function from ~Nat~ onto ~Nat~
   and use this function to rename free variables inside a λ-term. Thus its type
   is
   #+begin_src haskell
     rename :: (Nat -> Nat) -> Lambda -> Lambda
   #+end_src
   Given some function ~h~ of type ~Nat -> Nat~ (e.g., ~Succ~, as above), it renames
   variables by adjusting the natural number they correspond to using ~h~:
   #+begin_src haskell
     rename h (Var i) = Var (h i)
   #+end_src
   On applications, as you might expect, it performs renaming on both the
   function and the argument: 
   #+begin_src haskell
     rename h (App t u) = App (rename h t) (rename h u)
   #+end_src
   And on abstractions, it performs renaming on the body of the abstraction,
   but (as above) keeping bound variables intact and taking into account any
   extra ~Succ~ that might be lying around by using ~h'~ instead of ~h~:
   #+begin_src haskell
     rename h (Lam t) = Lam (rename h' t)
       where h' :: Nat -> Nat
	     h' Zero = Zero
	     h' (Succ i) = Succ (h i)
   #+end_src

   That's it for the definition of ~subst~! We can now use it to define a more
   immediately useful function
   #+begin_src haskell
     subst0 :: Lambda -> Lambda -> Lambda
   #+end_src
   which substitutes a λ-term ~t~ for ~Var Zero~ inside a λ-term ~u~ whose ~Lam~ has
   /just been taken off/. That is, we want to do a substitution inside a ~u~ whose
   free occurrences of ~Var Zero~ used to be bound by an enclosing ~Lam~ in the term
   ~Lam u~. This yields the following definition:
   #+begin_src haskell
     subst0 t = subst f
       where f :: Nat -> Lambda
	     f Zero = t
             f (Succ i) = Var i
   #+end_src
   
