notes/sept18/sept18.html

<div id="outline-container-org558f6fc" class="outline-3">
<h3 id="org558f6fc"><span class="section-number-3">1.2.</span> Substitution</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now that we are using de Bruijn indices, substitution becomes a bit tricky.
But we can tame it by dividing the task up into parts that are manageable to
do on their own.
</p>

<p>
First, let's define a very general function for doing arbitrary substitutions
of variables by λ-terms. This function should have the following type:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">subst</span> <span style="color: #83a598;">::</span> (<span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>
</pre>
</div>
<p>
It takes a function of type <code>Nat -&gt; Lambda</code> determining how the relevant
substitution (whatever that is) should be performed, and it provides a
general protocol for managing this substitution for different kinds of
λ-terms. For example, on variables, <code>subst</code> just <i>performs the substution</i>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">subst</span> f (<span style="color: #d3869b;">Var</span> i) <span style="color: #83a598;">=</span> f i
</pre>
</div>
<p>
On applications, it does the substitution to both the function and the
argument:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">subst</span> f (<span style="color: #d3869b;">App</span> t u) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">App</span> (subst f t) (subst f u)
</pre>
</div>
<p>
Finally, on abstractions, something special has to be done. Because we don't
want to mess around with variables which are <i>bound</i> by the abstraction, we
need to instead do substitution using another function <code>g</code> just like the
function <code>f</code>, but which is different in two ways. The first way it is different
is that it maps <code>Zero</code> onto <code>Var Zero</code>, ensuring that it remains bound by the
enclosing <code>Lam</code>. The second way it is different is that it maps any <code>Succ i</code> onto
<code>f i</code>, since the <code>Succ</code> was only there in order to ``look past'' the enclosing
<code>Lam</code> - it should really just be an <code>i</code> for the purpose of performing the
substitution - and it then <i>renames</i> the result of performing the substitution
<code>f i</code> by incrementing all free variables inside <code>f i</code> with a <code>Succ</code>, using a
function <code>rename</code>. This last part helps to avoid the problem of variable
capture, i.e., by making sure any free <code>j</code> inside <code>f i</code> still looks like a <code>j</code>
outside of the enclosing <code>Lam</code>, which mean that it has to be a <code>Succ j</code> inside
the enclosing <code>Lam</code>. 
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">subst</span> f (<span style="color: #d3869b;">Lam</span> t) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (subst g t)
  <span style="color: #fb4933;">where</span> g <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>
        g <span style="color: #d3869b;">Zero</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Zero</span>
        g (<span style="color: #d3869b;">Succ</span> i) <span style="color: #83a598;">=</span> rename <span style="color: #d3869b;">Succ</span> (f i)
</pre>
</div>
<p>
How exactly does <code>rename</code> work? It should take some function from <code>Nat</code> onto <code>Nat</code>
and use this function to rename free variables inside a λ-term. Thus its type
is
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">rename</span> <span style="color: #83a598;">::</span> (<span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Nat</span>) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>
</pre>
</div>
<p>
Given some function <code>h</code> of type <code>Nat -&gt; Nat</code> (e.g., <code>Succ</code>, as above), it renames
variables by adjusting the natural number they correspond to using <code>h</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">rename</span> h (<span style="color: #d3869b;">Var</span> i) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> (h i)
</pre>
</div>
<p>
On applications, as you might expect, it performs renaming on both the
function and the argument: 
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">rename</span> h (<span style="color: #d3869b;">App</span> t u) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">App</span> (rename h t) (rename h u)
</pre>
</div>
<p>
And on abstractions, it performs renaming on the body of the abstraction,
but (as above) keeping bound variables intact and taking into account any
extra <code>Succ</code> that might be lying around by using <code>h'</code> instead of <code>h</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">rename</span> h (<span style="color: #d3869b;">Lam</span> t) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (rename h' t)
  <span style="color: #fb4933;">where</span> h' <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Nat</span>
        h' <span style="color: #d3869b;">Zero</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Zero</span>
        h' (<span style="color: #d3869b;">Succ</span> i) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Succ</span> (h i)
</pre>
</div>

<p>
That's it for the definition of <code>subst</code>! We can now use it to define a more
immediately useful function
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">subst0</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>
</pre>
</div>
<p>
which substitutes a λ-term <code>t</code> for <code>Var Zero</code> inside a λ-term <code>u</code> whose <code>Lam</code> has
<i>just been taken off</i>. That is, we want to do a substitution inside a <code>u</code> whose
free occurrences of <code>Var Zero</code> used to be bound by an enclosing <code>Lam</code> in the term
<code>Lam u</code>. This yields the following definition:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">subst0</span> t <span style="color: #83a598;">=</span> subst f
  <span style="color: #fb4933;">where</span> f <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>
        f <span style="color: #d3869b;">Zero</span> <span style="color: #83a598;">=</span> t
        f (<span style="color: #d3869b;">Succ</span> i) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Var</span> i
</pre>
</div>
</div>
</div>
