notes/sept18/sept18.org
** β-reduction
   Now that we have a definition of substitution, we want to use it to define a
   function which takes any given λ-term into its β-normal form, assuming it has
   one. This function should just take a λ-term onto a λ-term, where the latter
   is in normal form; thus it should have the following type:
   #+begin_src haskell
     betaNormal :: Lambda -> Lambda
   #+end_src
   Again, there are three kinds of λ-terms we need to consider as the argument
   to this function. First, variables.
   #+begin_src haskell
     betaNormal v@(Var _) = v
   #+end_src
   Variables are already in β-normal form, so nothing needs to be done to them.
   Next, let's consider abstractions.
   #+begin_src haskell
     betaNormal (Lam t) = Lam (betaNormal t) 
   #+end_src
   Here, we only need to look underneath the binder ~Lam~ and normalize the body
   of the abstraction. The reasoning is as follows. Let's say ~u~ is in β-normal
   form; does turning ~u~ into ~Lam u~ create a β-redex somewhere? No! So as long as
   we have the body in normal form, adding a ~Lam~ won't make a difference. Next,
   the more tricky case: applications.
   #+begin_src haskell
     betaNormal (App t u) = case betaNormal t of
			      Lam t' -> betaNormal (subst0 (betaNormal u) t)
                              t' -> App t' (betaNormal u)
   #+end_src
   If taking the function ~t~ into β-normal form results in an abstraction, we
   need to perform a β-reduction step between the function and the argument
   (which we normalize). The result may not be in normal form, so we have to
   call ~betaNormal~ again at the end. If taking ~t~ into β-normal form does not
   result in an abstraction, than we can just take ~u~ onto its normal form and
   put the two back together into an application. The reasoning here is that
   putting them back together can't possibly create any new β-redices.
   
* Exercises: pretty printing
  We now have an encoding of the untyped λ-calculus using de Bruijn indices, as
  well as an encoding of β-reduction that lets us take any λ-term into its
  β-normal form, assuming it has one.

  But de Bruijn indies are ugly to look at, so it would nice to have a way of
  printing λ-terms out using the usual notation. These exercises aim to guide
  you in writing a pretty printer for our de Bruijn notation above, which
  renders it in terms of normal-looking λ-terms (yay!).

  To be able to print out arbitrary large λ-terms, we'll need an infinite supply
  of variable names. One neat thing you can do in Haskell is create infinite
  lists (though don't try to print them out!). Indeed, the following list is
  infinite and has some nice names for variables:
  #+begin_src haskell
    freshVars :: [String]
    freshVars = concat (map (\s -> map (\c -> c:s) "xyzuvw") appendMe)
      where appendMe :: [String]
	    appendMe = "" : map show ints

	    ints :: [Integer]
            ints = 1 : map (\x -> x + 1) ints
  #+end_src
  If you took, e.g., the first 50 elements of ~freshVars~, you'd get the
  following:
  #+begin_src haskell
    ghci> take 50 freshVars
    ["x","y","z","u","v","w","x1","y1","z1","u1","v1","w1","x2","y2","z2","u2","v2","w2","x3","y3","z3","u3","v3","w3","x4","y4","z4","u4","v4","w4","x5","y5","z5","u5","v5","w5","x6","y6","z6","u6","v6","w6","x7","y7","z7","u7","v7","w7","x8","y8"]
  #+end_src
  Note where the infinite structure of ~freshVars~ comes from: the definition of
  ~ints~, which is just an infinite list of positive integers, starting from ~1~.

  The goal in writing a pretty printer for λ-terms is to have a function
  #+begin_src haskell
    printLambda :: Lambda -> String
  #+end_src
  which takes a lambda term encoded using the algebraic data type ~Lambda~ onto a
  string representing that λ-term using the usual notation for λ-terms. This
  function should have the following behavior, for example:
  #+begin_src haskell
    ghci> putStrLn (printLambda (Lam (Var Zero)))
    (λx.x)
    ghci> putStrLn (printLambda (App (Lam (Var Zero)) (Lam (Lam (Var (Succ Zero))))))
    ((λx.x) (λx.(λy.x)))
    ghci> putStrLn (printLambda (Lam (Lam (Lam (Var (Succ Zero))))))
    (λx.(λy.(λz.y)))
    #+end_src

