notes/sept18/sept18.html

<div id="outline-container-org17cfe03" class="outline-3">
<h3 id="org17cfe03"><span class="section-number-3">1.3.</span> β-reduction</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Now that we have a definition of substitution, we want to use it to define a
function which takes any given λ-term into its β-normal form, assuming it has
one. This function should just take a λ-term onto a λ-term, where the latter
is in normal form; thus it should have the following type:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">betaNormal</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span>
</pre>
</div>
<p>
Again, there are three kinds of λ-terms we need to consider as the argument
to this function. First, variables.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">betaNormal</span> v<span style="color: #83a598;">@</span>(<span style="color: #d3869b;">Var</span> <span style="color: #fb4933;">_</span>) <span style="color: #83a598;">=</span> v
</pre>
</div>
<p>
Variables are already in β-normal form, so nothing needs to be done to them.
Next, let's consider abstractions.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">betaNormal</span> (<span style="color: #d3869b;">Lam</span> t) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (betaNormal t) 
</pre>
</div>
<p>
Here, we only need to look underneath the binder <code>Lam</code> and normalize the body
of the abstraction. The reasoning is as follows. Let's say <code>u</code> is in β-normal
form; does turning <code>u</code> into <code>Lam u</code> create a β-redex somewhere? No! So as long as
we have the body in normal form, adding a <code>Lam</code> won't make a difference. Next,
the more tricky case: applications.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">betaNormal</span> (<span style="color: #d3869b;">App</span> t u) <span style="color: #83a598;">=</span> <span style="color: #fb4933;">case</span> betaNormal t <span style="color: #fb4933;">of</span>
                         <span style="color: #d3869b;">Lam</span> t' <span style="color: #83a598;">-&gt;</span> betaNormal (subst0 (betaNormal u) t')
                         t' <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">App</span> t' (betaNormal u)
</pre>
</div>
<p>
If taking the function <code>t</code> into β-normal form results in an abstraction, we
need to perform a β-reduction step between the function and the argument
(which we normalize). The result may not be in normal form, so we have to
call <code>betaNormal</code> again at the end. If taking <code>t</code> into β-normal form does not
result in an abstraction, than we can just take <code>u</code> onto its normal form and
put the two back together into an application. The reasoning here is that
putting them back together can't possibly create any new β-redices.
</p>
</div>
</div>
</div>

<div id="outline-container-org31054fe" class="outline-2">
<h2 id="org31054fe"><span class="section-number-2">2.</span> Exercises: pretty printing</h2>
<div class="outline-text-2" id="text-2">
<p>
We now have an encoding of the untyped λ-calculus using de Bruijn indices, as
well as an encoding of β-reduction that lets us take any λ-term into its
β-normal form, assuming it has one.
</p>

<p>
But de Bruijn indies are ugly to look at, so it would nice to have a way of
printing λ-terms out using the usual notation. These exercises aim to guide
you in writing a pretty printer for our de Bruijn notation above, which
renders it in terms of normal-looking λ-terms (yay!).
</p>

<p>
To be able to print out arbitrary large λ-terms, we'll need an infinite supply
of variable names. One neat thing you can do in Haskell is create infinite
lists (though don't try to print them out!). Indeed, the following list is
infinite and has some nice names for variables:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">freshVars</span> <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">String</span>]
<span style="color: #fabd2f;">freshVars</span> <span style="color: #83a598;">=</span> concat (map (<span style="color: #83a598;">\</span>s <span style="color: #83a598;">-&gt;</span> map (<span style="color: #83a598;">\</span>c <span style="color: #83a598;">-&gt;</span> c<span style="color: #d3869b;">:</span>s) <span style="color: #b8bb26;">"xyzuvw"</span>) appendMe)
  <span style="color: #fb4933;">where</span> appendMe <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">String</span>]
        appendMe <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">""</span> <span style="color: #d3869b;">:</span> map show ints

        ints <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">Integer</span>]
        ints <span style="color: #83a598;">=</span> 1 <span style="color: #d3869b;">:</span> map (<span style="color: #83a598;">\</span>x <span style="color: #83a598;">-&gt;</span> x <span style="color: #83a598;">+</span> 1) ints
</pre>
</div>
<p>
If you took, e.g., the first 50 elements of <code>freshVars</code>, you'd get the
following:
</p>
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #fabd2f;">&gt;</span> take 50 freshVars
[<span style="color: #b8bb26;">"x"</span>,<span style="color: #b8bb26;">"y"</span>,<span style="color: #b8bb26;">"z"</span>,<span style="color: #b8bb26;">"u"</span>,<span style="color: #b8bb26;">"v"</span>,<span style="color: #b8bb26;">"w"</span>,<span style="color: #b8bb26;">"x1"</span>,<span style="color: #b8bb26;">"y1"</span>,<span style="color: #b8bb26;">"z1"</span>,<span style="color: #b8bb26;">"u1"</span>,<span style="color: #b8bb26;">"v1"</span>,<span style="color: #b8bb26;">"w1"</span>,<span style="color: #b8bb26;">"x2"</span>,<span style="color: #b8bb26;">"y2"</span>,<span style="color: #b8bb26;">"z2"</span>,<span style="color: #b8bb26;">"u2"</span>,<span style="color: #b8bb26;">"v2"</span>,<span style="color: #b8bb26;">"w2"</span>,<span style="color: #b8bb26;">"x3"</span>,<span style="color: #b8bb26;">"y3"</span>,<span style="color: #b8bb26;">"z3"</span>,<span style="color: #b8bb26;">"u3"</span>,<span style="color: #b8bb26;">"v3"</span>,<span style="color: #b8bb26;">"w3"</span>,<span style="color: #b8bb26;">"x4"</span>,<span style="color: #b8bb26;">"y4"</span>,<span style="color: #b8bb26;">"z4"</span>,<span style="color: #b8bb26;">"u4"</span>,<span style="color: #b8bb26;">"v4"</span>,<span style="color: #b8bb26;">"w4"</span>,<span style="color: #b8bb26;">"x5"</span>,<span style="color: #b8bb26;">"y5"</span>,<span style="color: #b8bb26;">"z5"</span>,<span style="color: #b8bb26;">"u5"</span>,<span style="color: #b8bb26;">"v5"</span>,<span style="color: #b8bb26;">"w5"</span>,<span style="color: #b8bb26;">"x6"</span>,<span style="color: #b8bb26;">"y6"</span>,<span style="color: #b8bb26;">"z6"</span>,<span style="color: #b8bb26;">"u6"</span>,<span style="color: #b8bb26;">"v6"</span>,<span style="color: #b8bb26;">"w6"</span>,<span style="color: #b8bb26;">"x7"</span>,<span style="color: #b8bb26;">"y7"</span>,<span style="color: #b8bb26;">"z7"</span>,<span style="color: #b8bb26;">"u7"</span>,<span style="color: #b8bb26;">"v7"</span>,<span style="color: #b8bb26;">"w7"</span>,<span style="color: #b8bb26;">"x8"</span>,<span style="color: #b8bb26;">"y8"</span>]
</pre>
</div>
<p>
Note where the infinite structure of <code>freshVars</code> comes from: the definition of
<code>ints</code>, which is just an infinite list of positive integers, starting from <code>1</code>.
</p>

<p>
The goal in writing a pretty printer for λ-terms is to have a function
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">printLambda</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">String</span>
</pre>
</div>
<p>
which takes a lambda term encoded using the algebraic data type <code>Lambda</code> onto a
string representing that λ-term using the usual notation for λ-terms. This
function should have the following behavior, for example:
</p>
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #fabd2f;">&gt;</span> putStrLn (printLambda (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Zero</span>)))
(&#955;x<span style="color: #83a598;">.</span>x)
ghci<span style="color: #fabd2f;">&gt;</span> putStrLn (printLambda (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">Zero</span>)) (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Succ</span> <span style="color: #d3869b;">Zero</span>))))))
((&#955;x<span style="color: #83a598;">.</span>x) (&#955;x<span style="color: #83a598;">.</span>(&#955;y<span style="color: #83a598;">.</span>x)))
ghci<span style="color: #fabd2f;">&gt;</span> putStrLn (printLambda (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Succ</span> <span style="color: #d3869b;">Zero</span>))))))
(&#955;x<span style="color: #83a598;">.</span>(&#955;y<span style="color: #83a598;">.</span>(&#955;z<span style="color: #83a598;">.</span>y)))
</pre>
</div>
</div>
