notes/sept18/sept18.org
** Part 1
   To define ~printLambda~, we'll start by defining a function
   #+begin_src haskell
     printLambda' :: [String] -> (Nat -> String) -> Lambda -> String
   #+end_src
   which takes a list of strings providing us with fresh variable names, along
   with a function of type ~Nat -> String~ that should actually use this list of
   names in some way. Given these two ingredients, it takes a ~Lambda~ onto a
   ~String~.

   We can define this function by first defining its behavior on variables:
   #+begin_src haskell
     printLambda' _ f (Var i) = f i
   #+end_src
   How should ~printLambda'~ be defined on applications? That is, fill out the
   rest of the following branch by filling in the ~_~:
   #+begin_src haskell
     printLambda' freshVs f (App t u) = _
   #+end_src

** Part 2
   The third branch, which involves abstractions, is the trickiest. Here, the
   list of fresh variable names actually needs to be used. This branch would
   look as follows:
   #+begin_src haskell
     printLambda' (fresh:vs) f (Lam t) =
       "(λ" ++ fresh ++ "." ++ printLambda f' vs t ++ ")"
       where f' :: Nat -> String
   #+end_src
  Fill out the rest of the definition of this branch by saying what ~f'~ does!

** Part 3
   Now that all three branches of ~printLambda'~ are defined, give a definition of
   ~printLambda~ using ~printLambda'~ by feeding it the appropriate pieces.
