notes/sept18/sept18.html

<div id="outline-container-orgb37bdb9" class="outline-3">
<h3 id="orgb37bdb9"><span class="section-number-3">2.1.</span> Part 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To define <code>printLambda</code>, we'll start by defining a function
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">printLambda'</span> <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">String</span>] <span style="color: #83a598;">-&gt;</span> (<span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">String</span>) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Lambda</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">String</span>
</pre>
</div>
<p>
which takes a list of strings providing us with fresh variable names, along
with a function of type <code>Nat -&gt; String</code> that should actually use this list of
names in some way. Given these two ingredients, it takes a <code>Lambda</code> onto a
<code>String</code>.
</p>

<p>
We can define this function by first defining its behavior on variables:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">printLambda'</span> <span style="color: #fb4933;">_</span> f (<span style="color: #d3869b;">Var</span> i) <span style="color: #83a598;">=</span> f i
</pre>
</div>
<p>
How should <code>printLambda'</code> be defined on applications? That is, fill out the
rest of the following branch by filling in the <code>_</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">printLambda'</span> freshVs f (<span style="color: #d3869b;">App</span> t u) <span style="color: #83a598;">=</span> <span style="color: #fb4933;">_</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org51abd26" class="outline-3">
<h3 id="org51abd26"><span class="section-number-3">2.2.</span> Part 2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The third branch, which involves abstractions, is the trickiest. Here, the
list of fresh variable names actually needs to be used. This branch would
look as follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">printLambda'</span> (fresh<span style="color: #d3869b;">:</span>vs) f (<span style="color: #d3869b;">Lam</span> t) <span style="color: #83a598;">=</span>
  <span style="color: #b8bb26;">"(&#955;"</span> <span style="color: #83a598;">++</span> fresh <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">"."</span> <span style="color: #83a598;">++</span> printLambda f' vs t <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">")"</span>
  <span style="color: #fb4933;">where</span> f' <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Nat</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">String</span>
</pre>
</div>
<p>
Fill out the rest of the definition of this branch by saying what <code>f'</code> does!
</p>
</div>
</div>

<div id="outline-container-orgacb4245" class="outline-3">
<h3 id="orgacb4245"><span class="section-number-3">2.3.</span> Part 3</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Now that all three branches of <code>printLambda'</code> are defined, give a definition of
<code>printLambda</code> using <code>printLambda'</code> by feeding it the appropriate pieces.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-09-19 Tue 21:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>